{
  title = "常见问题";
  items = [ {
    q = ''
      你是否会在ICO后立即出售你的ETC吗？
    '';
    a = ''
      不会，因为这会造成市场不稳定，对我们的用户产生负面影响。
    '';
  }
  {
    q = ''
      你会以ETC支付你的程序员吗？
    '';
    a = ''
      会，我们将努力以ETC支持我们的程序员。
    '';
  }
  {
    q = ''
      如果我写一个组件并将其销售给另一个程序员，而他们在层次结构中使用我的组件，并且再次出售。这样我会得到补偿吗？
    '';
    a = ''
      会，你拥有该组件，无论何处被引用，你都将获得就你的贡献得到补偿。
    '';
  }
  {
    q = ''
      你为什么需要ICO？
    '';
    a = ''
      我们需要一个用在应用市场货币，用户可用来买卖组件。
    '';
  }
  {
    q = ''
      对于Emerald SDK的工作，ETCDEV是否得到补偿？
    '';
    a = ''
      区块链组件将基于ETCDEV的软件模块，因此它们将从Fractalmarket的购买获得资金。这让他们可持续发展，并继续为Ethereum Classic社区做出贡献。
    '';
  }
  {
    q = ''
      ETC處於獨一無二的地位，因為它沒有一個擁有預礦的核心開發團隊，因此預計ETC的ICO會為ETC核心發展作出貢獻。你打算為ETC核心發展作出貢獻嗎？
    '';
    a = ''
      当然，我们希望能够从中建立和维护一个新的ETC客户端。此外，我们将与ETCDEV团队密切合作开发核心软件模块。
    '';
  }
  {
    q = ''
      这个ICO是否可建立一个能够长期支付程序员的产生收益公司？
    '';
    a = ''
      连同这个项目的预矿，和应用市场能产生足够的收入，希望可建立一个健全的公司，来聘请足够的程序员，来维持基础设施的可持续发展。
    '';
  }
  ];
}
