{
  id = "vision";
  title = "抱负";
  content = ''
    Fractalide 是一个快速应用程式开发(RAD)平台、一个App应用市场和一个崭新的以太坊经典(ETC)客户端。
    <h5>快速应用程式开发平台</h5>
    Fractalide从HyperCard中吸取了很多灵感。 HyperCard清晰易学的，非程序员也可以创建程序来解决现实世界问题。 HyperCard有两种模式：执行模式和开发模式。在两种模式之间切换不需要编译步骤，并不困难。在开发模式下，可通过将按钮或文本框之类的GUI小部件拖放到画布上来构建图形用户界面(GUI)。这幅画被称为卡片。然后，可以编写一种类似于英语的编程语言(称为HyperTalk)来执行Card GUI组件并将卡片链接在一起，成为一叠卡片(Stack)。以比喻来说，一张卡片是一个网页，一个Stack就是一个网站。人们使用Stacks并创造了电脑游戏到簿记的任何东西。
    <br><br>
    Fractalide利用HyperCard的优点，例如以简单直观的开发或执行环境，允许非程序员快速构建应用程序；拒绝某些缺点，例如无法通过网络共享Stacks，以及HyperTalk对于专业的程序员来说是太简单。
    <br><br>
    我们以面向对象程式语言Flowscript(这是Flow-based programming language 的实现)取代HyperTalk 。这些组件通常用现代编程语言编写，被设计为可共享、可重复使用和可再现。最接近的比喻是乐高(Lego)。程序员创建乐高块，非程序员使用乐高块。所以在这个环境中，我们可以在程序员和非程序员之间创造协同效应。程序员保留其定制的强大的开发环境，非程序员可以轻松地使用其组件构建强大的应用程序来解决现实世界的问题。
    <br><br>
    所以下一步就是，我们需要一种与世界分享这些强大组件的方法！
    <h5>App应用市场</h5>
    当完成上述HyperCard层后，便可构建应用程序(app)。应用市场app将是被创建的头几个应用程序。与Apple手机的Appstore应用程序非常相似，此Fractalide应用市场app可让你搜索并支付在Fractalide上运行的应用程序。
    <br><br>
    但与Apple 的AppStore 不同的是，构成应用程序的组件在Fractalide应用市场是可共享的，和可能包含在其他组件层次结构中。创建组件者每次出售其创建的组件时都会获得补偿，即使它是由另一个人创建的组件层次结构的一部分。
    <br><br>
    这样可鼓励程序员创建可重复使用、高效和被维持良好状态的组件。
    <br><br>
    最后的一个关于这个应用市场的重点是，将会创建一个新的加密货币，以实现Fractalide买方和卖方之间的交易。这就是可以在ICO购买的货币。
  '';
}
