{
  title = "FAQ";
  items = [ {
    q = ''
      ICOの後にすぐにETCを手放しますか?
    '';
    a = ''
      いいえ、これは市場の不安定さを招き、Fractalideユーザーに悪影響につながるため手放しません。
    '';
  }
  {
    q = ''
      ETCでプログラマーに支払いをしますか？
    '';
    a = ''
      プログラマー給与をETCで払う様に努めます。
    '';
  }
  {
    q = ''
      作成したコンポネントは他プログラムで利用された場合には報酬もらえますか?
    '';
    a = ''
      コンポネントは作成者の所有物のため、コンポネントが再利用された場合に作成者は報酬をもらえます。
    '';
  }
  {
    q = ''
      なぜICOが必要ですか?
    '';
    a = ''
      マーケットプレイスには通貨が必要となります。通貨のインセンティブは通貨価値の増大に繋がります。通貨は、初期支持者とコントリビューターに色んな形でインセンティブを与えるべきです。
    '';
  }
  {
    q = ''
      ETCDEVはEmerald SDKでの開発業務に報酬をもらえますか?
    '';
    a = ''
      ブロックチェーンのコンポーネントは、ETCDEVのライブラリに基づいています。そのため、フラクタルマーケットでの購入により収益を得ることができます。 これにより、彼らは持続可能で、Ethereum Classicコミュニティに貢献し続けることができます。
    '';
  }
  {
    q = ''
      コア開発チームがプレマインとインスタマインを多く所有しないETCは特別な立場にいます。そのためETCのICO関係者がETCのコア開発に参加すると期待されます。ETCコア開発に関わるつもりですか?
    '';
    a = ''
      その通りです、新たなETCクライアントを開発を目指しています。それ以外、ETCDEVチームと一緒にブロックチェーンのコアライブラリの開発に参加する予定です。
    '';
  }
  {
    q = ''
      ICOの資金で長期的にプログラマーを給与を払い続ける会社はできますか?
    '';
    a = ''
      プレマインのインセンティブと合せて、マーケットプレイスからインフラストラクチャを保つほどの人材を提供できる健全な会社を設立できる資本を生成できることを期待します。
    '';
  }
  ];
}
